<?php
echo "FOR <br/>";
echo "<hr>";

//For 1
echo "For 1. Даны целые числа K и N (N > 0). Вывести N раз число K. <br/><br/>";

$k = 69;
$n = 28;
echo "Число K = $k<br/>";
echo "Число N = $n<br/>";
for ($i = 0; $i <= $n; $i++) {
	echo  $k;
}
echo "<hr>";

//For 2
echo "For 2. Даны 2 целых числа А и В (А < В). Вывести в порядке возрастания все целые числа, расположенные между А и В (включая сами числа А и В), а так же количество N этих чисел.<br/><br/>";

$a = 1;
$b = 20;
$n = 0;
$c = 0;
echo "Число A = $a<br/>";
echo "Число B = $b<br/>";
if ($a < $b){
	for (; $a <= $b; ++$a) {
		$c++;
		echo "$c ";
		$n++;
	}
} else {
	echo "А >В<br/>";
}
echo "<br/>Количество чисел: $n<br/>";
echo "<hr>";

//For 3
echo "For 3. Даны 2 целых числа А и В (А < В). Вывести в порядке убывания все целые числа, расположенные между А и В (включая сами числа А и В), а так же количество N этих чисел.<br/><br/>";

$a = 1;
$b = 20;
$n = 0;
$c = $b;
echo "Число A = $a<br/>";
echo "Число B = $b<br/>";
if ($a < $b){
	for (; $b >= $a+1; $b--) {
		$c--;
		echo "$c ";
		$n++;
	}
} else {
	echo "А >В<br/>";
}
echo "<br/>Количество чисел: $n<br/>";
echo "<hr>";

//For 4
echo "For 4. Дано вещественное число - цена 1 кг конфет. Вывести стоимость 1, 2...10 кг конфет.<br/><br/>";

$a = 45;
$n = 0;
$c = 0;
echo "Число A = $a<br/>";
	for ($n = 1; $n <= 10; $n++) {
		$c = $n * $a;
		echo "Цена за кг: $c <br/>";
	}
echo "<hr>";

//For 5
echo "For 5. Дано вещественное число - цена 1 кг конфет. Вывести стоимость 0.1,0.2 ...1 кг конфет.<br/><br/>";

$a = 50;
$n = 0;
$c = 0;
$k = 0.1;
echo "Число A = $a<br/>";
	for ($n = 1; $n <= 10; $n++) {
		$k = $k + 0.1;
		$c = $a * $k;
		echo "Цена за кг: $c <br/>";
	}
echo "<hr>";

//For 6
echo "For 6. Дано вещественное число - цена 1 кг конфет. Вывести стоимость 1.2, 1.4...2 кг конфет.<br/><br/>";

$a = 33;
$n = 0;
$c = 0;
$k = 1;
echo "Число A = $a<br/>";
	for ($n = 1; $n <= 10; $n++) {
		$k = $k + 0.1;
		$c = $a * $k;
		echo "Цена за кг: $c <br/>";
	}
echo "<hr>";

//For 7
echo "For 7. Дано вещественное число - цена 1 кг конфет. Вывести стоимость 1.2, 1.4...2 кг конфет.<br/><br/>";

$a = 33;
$n = 0;
$c = 0;
$k = 1;
echo "Число A = $a<br/>";
	for ($n = 1; $n <= 10; $n++) {
		$k = $k + 0.1;
		$c = $a * $k;
		echo "Цена за кг: $c <br/>";
	}
echo "<hr>";